app/Controllers/Home.php

SELECT *
FROM `kepadatan_penduduk`
---
    public function index(): string
    {
        $data_JumlahPenduduk = new JumlahPenduduk();
        $all_data_JumlahPenduduk = $data_JumlahPenduduk->findAll();

        $data_KepadatanPenduduk = new KepadatanPenduduk();
        $all_data_KepadatanPenduduk = $data_KepadatanPenduduk->findAll();

SELECT *
FROM `indeks_yang_mempengaruhi`
SELECT *
FROM `inflasi`
SELECT *
FROM `ketenagakerjaan`
---
    public function index_IKK(): string
    {
        $data_IndeksYangMempengaruhi = new IndeksYangMempengaruhi();
        $all_data_IndeksYangMempengaruhi = $data_IndeksYangMempengaruhi->findAll();

        $data_Inflasi = new Inflasi();
        $all_data_Inflasi = $data_Inflasi->findAll();

        $data_Ketenagakerjaan = new Ketenagakerjaan();
        $all_data_Ketenagakerjaan = $data_Ketenagakerjaan->findAll();

SELECT *
FROM `angka_harapan_hidup`
SELECT *
FROM `lama_sekolah`
SELECT *
FROM `pengeluaran_perkapita`
---
    public function index_IPM(): string
    {
        $data_AngkaHarapanHidup = new AngkaHarapanHidup();
        $all_data_AngkaHarapanHidup = $data_AngkaHarapanHidup->findAll();

        $data_IndeksPembangunan = new IndeksPembangunan();
        $all_data_IndeksPembangunan = $data_IndeksPembangunan->findAll();

        $data_LamaSekolah = new LamaSekolah();
        $all_data_LamaSekolah = $data_LamaSekolah->findAll();

        $data_PengeluaranPerkapita = new PengeluaranPerkapita();
        $all_data_PengeluaranPerkapita = $data_PengeluaranPerkapita->findAll();

SELECT *
FROM `laju_pertumbuhan`
---
    public function index_PDRB(): string
    {
        $data_LajuPertumbuhan = new LajuPertumbuhan();
        $all_data_LajuPertumbuhan = $data_LajuPertumbuhan->findAll();

SELECT *
FROM `kepadatan_penduduk`
---
    public function table(): string
    {
        $data_JumlahPenduduk = new JumlahPenduduk();
        $all_data_JumlahPenduduk = $data_JumlahPenduduk->findAll();

        $data_KepadatanPenduduk = new KepadatanPenduduk();
        $all_data_KepadatanPenduduk = $data_KepadatanPenduduk->findAll();

SELECT *
FROM `laju_pertumbuhan`
---
    public function table_LajuPertumbuhan(): string
    {
        $data_LajuPertumbuhan = new LajuPertumbuhan();
        $all_data_LajuPertumbuhan  = $data_LajuPertumbuhan->findAll();